app/views/projects/show.html.erb

<ul>
  <% @project.rewards.each do |reward| %>
---
SELECT "rewards".* FROM "rewards" WHERE "rewards"."project_id" = ?  [["project_id", 3]]