app/controllers/projects_controller.rb

INSERT INTO "projects" ("name", "description", "start_date", "end_date", "funding_goal", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    @project = Project.new(project_params)

    if @project.save