app/controllers/users_controller.rb

INSERT INTO "users" ("email", "first_name", "last_name", "salt", "crypted_password", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save